---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SpatialElementGeometryCalculator
source: html/2d692135-d5a7-0672-5f88-b93196aa42a5.htm
---
# SpatialElementGeometryCalculator Members

Constructs a new calculator with default options for the geometry of spatial elements.